ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_GBLINFO0" width="32" offset="0x13F0" description="Global Information Register 0">
        <bitfield id="SECTORSIZE" description="Sector size in bytes" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="ONEKB" value="0x400" description="Sector size is ONEKB"/>
            <bitenum id="TWOKB" value="0x800" description="Sector size is TWOKB"/>
        </bitfield>
        <bitfield id="NUMBANKS" description="Number of banks instantiated
Minimum:	1
Maximum:	5" begin="18" end="16" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x1" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_GBLINFO1" width="32" offset="0x13F4" description="Global Information Register 1">
        <bitfield id="DATAWIDTH" description="Data width in bits" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="W64BIT" value="0x40" description="Data width is 64 bits"/>
            <bitenum id="W128BIT" value="0x80" description="Data width is 128 bits"/>
        </bitfield>
        <bitfield id="ECCWIDTH" description="ECC data width in bits" begin="12" end="8" width="5" rwaccess="R">
            <bitenum id="W0BIT" value="0x0" description="ECC data width is 0.  ECC not used."/>
            <bitenum id="W8BIT" value="0x8" description="ECC data width is 8 bits"/>
            <bitenum id="W16BIT" value="0x10" description="ECC data width is 16 bits"/>
        </bitfield>
        <bitfield id="REDWIDTH" description="Redundant data width in bits" begin="18" end="16" width="3" rwaccess="R">
            <bitenum id="W0BIT" value="0x0" description="Redundant data width is 0.  Redundancy/Repair not present."/>
            <bitenum id="W2BIT" value="0x2" description="Redundant data width is 2 bits"/>
            <bitenum id="W4BIT" value="0x4" description="Redundant data width is 4 bits"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_GBLINFO2" width="32" offset="0x13F8" description="Global Information Register 2">
        <bitfield id="DATAREGISTERS" description="Number of data registers present." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x1" description="Minimum value of [DATAREGISTERS]"/>
            <bitenum id="MAXIMUM" value="0x8" description="Maximum value of [DATAREGISTERS]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_BANK0INFO0" width="32" offset="0x1400" description="Bank Information Register 0 for Bank 0">
        <bitfield id="MAINSIZE" description="Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)" begin="11" end="0" width="12" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x8" description="Minimum value of [MAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x200" description="Maximum value of [MAINSIZE]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_BANK0INFO1" width="32" offset="0x1404" description="Bank Information Register 1 for Bank 0">
        <bitfield id="NONMAINSIZE" description="Non-main region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [NONMAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [NONMAINSIZE]"/>
        </bitfield>
        <bitfield id="TRIMSIZE" description="Trim region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)" begin="15" end="8" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [TRIMSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [TRIMSIZE]"/>
        </bitfield>
        <bitfield id="ENGRSIZE" description="Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)" begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [ENGRSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [ENGRSIZE]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_BANK1INFO0" width="32" offset="0x1410" description="Bank Information Register 0 for Bank 1">
        <bitfield id="MAINSIZE" description="Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)" begin="11" end="0" width="12" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x8" description="Minimum value of [MAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x200" description="Maximum value of [MAINSIZE]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_BANK1INFO1" width="32" offset="0x1414" description="Bank Information Register 1 for Bank 1">
        <bitfield id="NONMAINSIZE" description="Non-main region size in sectors" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [NONMAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [NONMAINSIZE]"/>
        </bitfield>
        <bitfield id="TRIMSIZE" description="Trim region size in sectors" begin="15" end="8" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [TRIMSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [TRIMSIZE]"/>
        </bitfield>
        <bitfield id="ENGRSIZE" description="Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)" begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [ENGRSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [ENGRSIZE]"/>
        </bitfield>
    </register>

</module>